CREATE TABLE режиссери (
    id SERIAL PRIMARY KEY,
    ім’я VARCHAR(255),
    прізвище VARCHAR(255)
);

INSERT INTO режиссери (ім’я, прізвище) VALUES
    ('Ім’я1', 'Прізвище1'),
    ('Ім’я2', 'Прізвище2'),
    ('Ім’я3', 'Прізвище3'),
    ('Ім’я4', 'Прізвище4'),
    ('Ім’я5', 'Прізвище5');

CREATE TABLE фільми (
    id SERIAL PRIMARY KEY,
    назва VARCHAR(255) UNIQUE,
    жанр VARCHAR(255),
    рік_випуску INTEGER,
    режиссер_id INTEGER REFERENCES режиссери(id)
);

INSERT INTO фільми (назва, жанр, рік_випуску, режиссер_id) VALUES
    ('Фільм1', 'Жанр1', 2020, 1),
    ('Фільм2', 'Жанр2', 2019, 2),
    ('Фільм3', 'Жанр3', 2021, 3),
    ('Фільм4', 'Жанр4', 2018, 4),
    ('Фільм5', 'Жанр5', 2022, 5);

SELECT * FROM режиссери;

SELECT фільми.*, режиссери.ім’я, режиссери.прізвище
FROM фільми
JOIN режиссери ON фільми.режиссер_id = режиссери.id;
